{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.4", "config": [{"class_name": "Permute", "config": {"batch_input_shape": [null, 4, 36, 46], "trainable": true, "name": "permute_1", "dtype": "float32", "dims": [2, 3, 1]}}, {"class_name": "Conv2D", "config": {"padding": "valid", "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "strides": [4, 4], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [8, 8], "activity_regularizer": null, "name": "conv2d_1", "bias_constraint": null, "filters": 32}}, {"class_name": "Conv2D", "config": {"padding": "valid", "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "strides": [2, 2], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [4, 4], "activity_regularizer": null, "name": "conv2d_2", "bias_constraint": null, "filters": 64}}, {"class_name": "Conv2D", "config": {"padding": "valid", "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_3", "bias_constraint": null, "filters": 64}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "trainable": true, "activity_regularizer": null, "units": 512, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "name": "dense_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "trainable": true, "activity_regularizer": null, "units": 2, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "name": "dense_2"}}]}