{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Permute", "config": {"name": "permute_1", "trainable": true, "batch_input_shape": [null, 4, 84, 84], "dtype": "float32", "dims": [2, 3, 1]}}, {"class_name": "Conv2D", "config": {"strides": [4, 4], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "kernel_size": [8, 8], "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "name": "conv2d_1", "filters": 32, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "kernel_size": [4, 4], "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "name": "conv2d_2", "filters": 64, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "name": "conv2d_3", "filters": 64, "bias_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "units": 512, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "units": 2, "bias_regularizer": null}}], "keras_version": "2.1.4"}